Revit 2026 API

# FormMoveProfile Method

---

Move a profile of the form, specified by a reference, and an offset vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void MoveProfile(
	int profileIndex,
	XYZ offset
)
```
```vb
Public Sub MoveProfile (
	profileIndex As Integer,
	offset As XYZ
)
```
```cpp
public:
void MoveProfile(
	int profileIndex,
	XYZ^ offset
)
```
```fsharp
member MoveProfile :
        profileIndex : int *
        offset : XYZ -> unit
```

#### Parameters

profileIndex Int32
    Index to specify the profile.
offset XYZ
     The vector by which the element is to be moved.

#### Reference

Form Class

Autodesk.Revit.DB Namespace